In [1]:
import pandas as pd
import numpy as np

In [3]:
# Sample DataFrame 
data = {
    'Date': pd.to_datetime(['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02', '2023-01-01', '2023-01-02']),
    'City': ['New York', 'Los Angeles', 'New York', 'Los Angeles', 'Chicago', 'Chicago'],
    'Metric': ['Temperature', 'Temperature', 'Temperature', 'Temperature', 'Humidity', 'Humidity'],
    'Value': [32, 75, 30, 77, 60, 65]
}

In [5]:
df = pd.DataFrame(data)

In [7]:
df

        Date         City       Metric  Value
0 2023-01-01     New York  Temperature     32
1 2023-01-01  Los Angeles  Temperature     75
2 2023-01-02     New York  Temperature     30
3 2023-01-02  Los Angeles  Temperature     77
4 2023-01-01      Chicago     Humidity     60
5 2023-01-02      Chicago     Humidity     65

In [11]:
print("Original DataFrame:")
print(df)
print("-" * 30)

Original DataFrame:
        Date         City       Metric  Value
0 2023-01-01     New York  Temperature     32
1 2023-01-01  Los Angeles  Temperature     75
2 2023-01-02     New York  Temperature     30
3 2023-01-02  Los Angeles  Temperature     77
4 2023-01-01      Chicago     Humidity     60
5 2023-01-02      Chicago     Humidity     65
------------------------------

##### 1. Reshaping from Long to Wide Format

In [14]:
data_pivot = {
    'Date': pd.to_datetime(['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02']),
    'City': ['New York', 'Los Angeles', 'New York', 'Los Angeles'],
    'Temperature': [32, 75, 30, 77]
}
df_pivot = pd.DataFrame(data_pivot)

In [18]:
df_pivot

        Date         City  Temperature
0 2023-01-01     New York           32
1 2023-01-01  Los Angeles           75
2 2023-01-02     New York           30
3 2023-01-02  Los Angeles           77

In [20]:
print("DataFrame for pivot():")
print(df_pivot)
print("-" * 30)

DataFrame for pivot():
        Date         City  Temperature
0 2023-01-01     New York           32
1 2023-01-01  Los Angeles           75
2 2023-01-02     New York           30
3 2023-01-02  Los Angeles           77
------------------------------

In [24]:
# Pivot the DataFrame
pivoted_df = df_pivot.pivot(index='Date', columns='City', values='Temperature')
print("Pivoted DataFrame:")
print(pivoted_df)
print("-" * 30)

Pivoted DataFrame:
City        Los Angeles  New York
Date
2023-01-01           75        32
2023-01-02           77        30
------------------------------